/******************************************************************************
某校為了不讓學生互相比較成績，所以成績上記錄的是成績等第而不是分數，它的規則如下：
 
    90分(含)~100分(含)為A等
    80分(含)~90分(不含)為B等
    70分(含)~80分(不含)為C等
    60分(含)~70分(不含)為D等
    不滿60分者為E等
現在給一個成績，請判斷它是哪一個等第。
*******************************************************************************/
#include <iostream>
using namespace std;
 
int main()
{
  int score;
   printf(" 請輸入成績 \n"); 
   scanf("%d",&score);
   if(score >100){
       printf("錯誤!成績大於100");
   }
   else if (score >= 90){
       printf(" 成績為 %s \n", "A");
   }else if (score >=80){
       printf(" 成績為 %s \n", "B");
   }else if (score >=70){
       printf(" 成績為 %s \n", "C");   
   }else if (score >=60){
       printf(" 成績為 %s \n", "D");       
   }else{
       printf(" 成績為 %s \n", "E");
   }
   return 0;
}  
